; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l9-t1-p4---int100n150-m25---int100c150---s120---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 l5 l6 l7 l8 - location
t0 - truck
p0 p1 p2 p3 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 - fuellevel
)

(:init
(sum level0 level2 level2)
(sum level0 level4 level4)
(sum level0 level5 level5)
(sum level0 level6 level6)
(sum level0 level9 level9)
(sum level0 level12 level12)
(sum level0 level14 level14)
(sum level0 level15 level15)
(sum level0 level18 level18)
(sum level0 level21 level21)
(sum level0 level25 level25)
(sum level1 level2 level3)
(sum level1 level4 level5)
(sum level1 level5 level6)
(sum level1 level6 level7)
(sum level1 level9 level10)
(sum level1 level12 level13)
(sum level1 level14 level15)
(sum level1 level15 level16)
(sum level1 level18 level19)
(sum level1 level21 level22)
(sum level1 level25 level26)
(sum level2 level2 level4)
(sum level2 level4 level6)
(sum level2 level5 level7)
(sum level2 level6 level8)
(sum level2 level9 level11)
(sum level2 level12 level14)
(sum level2 level14 level16)
(sum level2 level15 level17)
(sum level2 level18 level20)
(sum level2 level21 level23)
(sum level2 level25 level27)
(sum level3 level2 level5)
(sum level3 level4 level7)
(sum level3 level5 level8)
(sum level3 level6 level9)
(sum level3 level9 level12)
(sum level3 level12 level15)
(sum level3 level14 level17)
(sum level3 level15 level18)
(sum level3 level18 level21)
(sum level3 level21 level24)
(sum level3 level25 level28)
(sum level4 level2 level6)
(sum level4 level4 level8)
(sum level4 level5 level9)
(sum level4 level6 level10)
(sum level4 level9 level13)
(sum level4 level12 level16)
(sum level4 level14 level18)
(sum level4 level15 level19)
(sum level4 level18 level22)
(sum level4 level21 level25)
(sum level4 level25 level29)
(sum level5 level2 level7)
(sum level5 level4 level9)
(sum level5 level5 level10)
(sum level5 level6 level11)
(sum level5 level9 level14)
(sum level5 level12 level17)
(sum level5 level14 level19)
(sum level5 level15 level20)
(sum level5 level18 level23)
(sum level5 level21 level26)
(sum level5 level25 level30)
(sum level6 level2 level8)
(sum level6 level4 level10)
(sum level6 level5 level11)
(sum level6 level6 level12)
(sum level6 level9 level15)
(sum level6 level12 level18)
(sum level6 level14 level20)
(sum level6 level15 level21)
(sum level6 level18 level24)
(sum level6 level21 level27)
(sum level6 level25 level31)
(sum level7 level2 level9)
(sum level7 level4 level11)
(sum level7 level5 level12)
(sum level7 level6 level13)
(sum level7 level9 level16)
(sum level7 level12 level19)
(sum level7 level14 level21)
(sum level7 level15 level22)
(sum level7 level18 level25)
(sum level7 level21 level28)
(sum level7 level25 level32)
(sum level8 level2 level10)
(sum level8 level4 level12)
(sum level8 level5 level13)
(sum level8 level6 level14)
(sum level8 level9 level17)
(sum level8 level12 level20)
(sum level8 level14 level22)
(sum level8 level15 level23)
(sum level8 level18 level26)
(sum level8 level21 level29)
(sum level8 level25 level33)
(sum level9 level2 level11)
(sum level9 level4 level13)
(sum level9 level5 level14)
(sum level9 level6 level15)
(sum level9 level9 level18)
(sum level9 level12 level21)
(sum level9 level14 level23)
(sum level9 level15 level24)
(sum level9 level18 level27)
(sum level9 level21 level30)
(sum level9 level25 level34)
(sum level10 level2 level12)
(sum level10 level4 level14)
(sum level10 level5 level15)
(sum level10 level6 level16)
(sum level10 level9 level19)
(sum level10 level12 level22)
(sum level10 level14 level24)
(sum level10 level15 level25)
(sum level10 level18 level28)
(sum level10 level21 level31)
(sum level10 level25 level35)
(sum level11 level2 level13)
(sum level11 level4 level15)
(sum level11 level5 level16)
(sum level11 level6 level17)
(sum level11 level9 level20)
(sum level11 level12 level23)
(sum level11 level14 level25)
(sum level11 level15 level26)
(sum level11 level18 level29)
(sum level11 level21 level32)
(sum level11 level25 level36)
(sum level12 level2 level14)
(sum level12 level4 level16)
(sum level12 level5 level17)
(sum level12 level6 level18)
(sum level12 level9 level21)
(sum level12 level12 level24)
(sum level12 level14 level26)
(sum level12 level15 level27)
(sum level12 level18 level30)
(sum level12 level21 level33)
(sum level12 level25 level37)
(sum level13 level2 level15)
(sum level13 level4 level17)
(sum level13 level5 level18)
(sum level13 level6 level19)
(sum level13 level9 level22)
(sum level13 level12 level25)
(sum level13 level14 level27)
(sum level13 level15 level28)
(sum level13 level18 level31)
(sum level13 level21 level34)
(sum level13 level25 level38)
(sum level14 level2 level16)
(sum level14 level4 level18)
(sum level14 level5 level19)
(sum level14 level6 level20)
(sum level14 level9 level23)
(sum level14 level12 level26)
(sum level14 level14 level28)
(sum level14 level15 level29)
(sum level14 level18 level32)
(sum level14 level21 level35)
(sum level14 level25 level39)
(sum level15 level2 level17)
(sum level15 level4 level19)
(sum level15 level5 level20)
(sum level15 level6 level21)
(sum level15 level9 level24)
(sum level15 level12 level27)
(sum level15 level14 level29)
(sum level15 level15 level30)
(sum level15 level18 level33)
(sum level15 level21 level36)
(sum level15 level25 level40)
(sum level16 level2 level18)
(sum level16 level4 level20)
(sum level16 level5 level21)
(sum level16 level6 level22)
(sum level16 level9 level25)
(sum level16 level12 level28)
(sum level16 level14 level30)
(sum level16 level15 level31)
(sum level16 level18 level34)
(sum level16 level21 level37)
(sum level16 level25 level41)
(sum level17 level2 level19)
(sum level17 level4 level21)
(sum level17 level5 level22)
(sum level17 level6 level23)
(sum level17 level9 level26)
(sum level17 level12 level29)
(sum level17 level14 level31)
(sum level17 level15 level32)
(sum level17 level18 level35)
(sum level17 level21 level38)
(sum level17 level25 level42)
(sum level18 level2 level20)
(sum level18 level4 level22)
(sum level18 level5 level23)
(sum level18 level6 level24)
(sum level18 level9 level27)
(sum level18 level12 level30)
(sum level18 level14 level32)
(sum level18 level15 level33)
(sum level18 level18 level36)
(sum level18 level21 level39)
(sum level18 level25 level43)
(sum level19 level2 level21)
(sum level19 level4 level23)
(sum level19 level5 level24)
(sum level19 level6 level25)
(sum level19 level9 level28)
(sum level19 level12 level31)
(sum level19 level14 level33)
(sum level19 level15 level34)
(sum level19 level18 level37)
(sum level19 level21 level40)
(sum level19 level25 level44)
(sum level20 level2 level22)
(sum level20 level4 level24)
(sum level20 level5 level25)
(sum level20 level6 level26)
(sum level20 level9 level29)
(sum level20 level12 level32)
(sum level20 level14 level34)
(sum level20 level15 level35)
(sum level20 level18 level38)
(sum level20 level21 level41)
(sum level20 level25 level45)
(sum level21 level2 level23)
(sum level21 level4 level25)
(sum level21 level5 level26)
(sum level21 level6 level27)
(sum level21 level9 level30)
(sum level21 level12 level33)
(sum level21 level14 level35)
(sum level21 level15 level36)
(sum level21 level18 level39)
(sum level21 level21 level42)
(sum level21 level25 level46)
(sum level22 level2 level24)
(sum level22 level4 level26)
(sum level22 level5 level27)
(sum level22 level6 level28)
(sum level22 level9 level31)
(sum level22 level12 level34)
(sum level22 level14 level36)
(sum level22 level15 level37)
(sum level22 level18 level40)
(sum level22 level21 level43)
(sum level22 level25 level47)
(sum level23 level2 level25)
(sum level23 level4 level27)
(sum level23 level5 level28)
(sum level23 level6 level29)
(sum level23 level9 level32)
(sum level23 level12 level35)
(sum level23 level14 level37)
(sum level23 level15 level38)
(sum level23 level18 level41)
(sum level23 level21 level44)
(sum level23 level25 level48)
(sum level24 level2 level26)
(sum level24 level4 level28)
(sum level24 level5 level29)
(sum level24 level6 level30)
(sum level24 level9 level33)
(sum level24 level12 level36)
(sum level24 level14 level38)
(sum level24 level15 level39)
(sum level24 level18 level42)
(sum level24 level21 level45)
(sum level24 level25 level49)
(sum level25 level2 level27)
(sum level25 level4 level29)
(sum level25 level5 level30)
(sum level25 level6 level31)
(sum level25 level9 level34)
(sum level25 level12 level37)
(sum level25 level14 level39)
(sum level25 level15 level40)
(sum level25 level18 level43)
(sum level25 level21 level46)
(sum level25 level25 level50)
(sum level26 level2 level28)
(sum level26 level4 level30)
(sum level26 level5 level31)
(sum level26 level6 level32)
(sum level26 level9 level35)
(sum level26 level12 level38)
(sum level26 level14 level40)
(sum level26 level15 level41)
(sum level26 level18 level44)
(sum level26 level21 level47)
(sum level26 level25 level51)
(sum level27 level2 level29)
(sum level27 level4 level31)
(sum level27 level5 level32)
(sum level27 level6 level33)
(sum level27 level9 level36)
(sum level27 level12 level39)
(sum level27 level14 level41)
(sum level27 level15 level42)
(sum level27 level18 level45)
(sum level27 level21 level48)
(sum level27 level25 level52)
(sum level28 level2 level30)
(sum level28 level4 level32)
(sum level28 level5 level33)
(sum level28 level6 level34)
(sum level28 level9 level37)
(sum level28 level12 level40)
(sum level28 level14 level42)
(sum level28 level15 level43)
(sum level28 level18 level46)
(sum level28 level21 level49)
(sum level28 level25 level53)
(sum level29 level2 level31)
(sum level29 level4 level33)
(sum level29 level5 level34)
(sum level29 level6 level35)
(sum level29 level9 level38)
(sum level29 level12 level41)
(sum level29 level14 level43)
(sum level29 level15 level44)
(sum level29 level18 level47)
(sum level29 level21 level50)
(sum level29 level25 level54)
(sum level30 level2 level32)
(sum level30 level4 level34)
(sum level30 level5 level35)
(sum level30 level6 level36)
(sum level30 level9 level39)
(sum level30 level12 level42)
(sum level30 level14 level44)
(sum level30 level15 level45)
(sum level30 level18 level48)
(sum level30 level21 level51)
(sum level30 level25 level55)
(sum level31 level2 level33)
(sum level31 level4 level35)
(sum level31 level5 level36)
(sum level31 level6 level37)
(sum level31 level9 level40)
(sum level31 level12 level43)
(sum level31 level14 level45)
(sum level31 level15 level46)
(sum level31 level18 level49)
(sum level31 level21 level52)
(sum level31 level25 level56)
(sum level32 level2 level34)
(sum level32 level4 level36)
(sum level32 level5 level37)
(sum level32 level6 level38)
(sum level32 level9 level41)
(sum level32 level12 level44)
(sum level32 level14 level46)
(sum level32 level15 level47)
(sum level32 level18 level50)
(sum level32 level21 level53)
(sum level32 level25 level57)
(sum level33 level2 level35)
(sum level33 level4 level37)
(sum level33 level5 level38)
(sum level33 level6 level39)
(sum level33 level9 level42)
(sum level33 level12 level45)
(sum level33 level14 level47)
(sum level33 level15 level48)
(sum level33 level18 level51)
(sum level33 level21 level54)
(sum level33 level25 level58)
(sum level34 level2 level36)
(sum level34 level4 level38)
(sum level34 level5 level39)
(sum level34 level6 level40)
(sum level34 level9 level43)
(sum level34 level12 level46)
(sum level34 level14 level48)
(sum level34 level15 level49)
(sum level34 level18 level52)
(sum level34 level21 level55)
(sum level34 level25 level59)
(sum level35 level2 level37)
(sum level35 level4 level39)
(sum level35 level5 level40)
(sum level35 level6 level41)
(sum level35 level9 level44)
(sum level35 level12 level47)
(sum level35 level14 level49)
(sum level35 level15 level50)
(sum level35 level18 level53)
(sum level35 level21 level56)
(sum level35 level25 level60)
(sum level36 level2 level38)
(sum level36 level4 level40)
(sum level36 level5 level41)
(sum level36 level6 level42)
(sum level36 level9 level45)
(sum level36 level12 level48)
(sum level36 level14 level50)
(sum level36 level15 level51)
(sum level36 level18 level54)
(sum level36 level21 level57)
(sum level36 level25 level61)
(sum level37 level2 level39)
(sum level37 level4 level41)
(sum level37 level5 level42)
(sum level37 level6 level43)
(sum level37 level9 level46)
(sum level37 level12 level49)
(sum level37 level14 level51)
(sum level37 level15 level52)
(sum level37 level18 level55)
(sum level37 level21 level58)
(sum level37 level25 level62)
(sum level38 level2 level40)
(sum level38 level4 level42)
(sum level38 level5 level43)
(sum level38 level6 level44)
(sum level38 level9 level47)
(sum level38 level12 level50)
(sum level38 level14 level52)
(sum level38 level15 level53)
(sum level38 level18 level56)
(sum level38 level21 level59)
(sum level38 level25 level63)
(sum level39 level2 level41)
(sum level39 level4 level43)
(sum level39 level5 level44)
(sum level39 level6 level45)
(sum level39 level9 level48)
(sum level39 level12 level51)
(sum level39 level14 level53)
(sum level39 level15 level54)
(sum level39 level18 level57)
(sum level39 level21 level60)
(sum level39 level25 level64)
(sum level40 level2 level42)
(sum level40 level4 level44)
(sum level40 level5 level45)
(sum level40 level6 level46)
(sum level40 level9 level49)
(sum level40 level12 level52)
(sum level40 level14 level54)
(sum level40 level15 level55)
(sum level40 level18 level58)
(sum level40 level21 level61)
(sum level40 level25 level65)
(sum level41 level2 level43)
(sum level41 level4 level45)
(sum level41 level5 level46)
(sum level41 level6 level47)
(sum level41 level9 level50)
(sum level41 level12 level53)
(sum level41 level14 level55)
(sum level41 level15 level56)
(sum level41 level18 level59)
(sum level41 level21 level62)
(sum level41 level25 level66)
(sum level42 level2 level44)
(sum level42 level4 level46)
(sum level42 level5 level47)
(sum level42 level6 level48)
(sum level42 level9 level51)
(sum level42 level12 level54)
(sum level42 level14 level56)
(sum level42 level15 level57)
(sum level42 level18 level60)
(sum level42 level21 level63)
(sum level42 level25 level67)
(sum level43 level2 level45)
(sum level43 level4 level47)
(sum level43 level5 level48)
(sum level43 level6 level49)
(sum level43 level9 level52)
(sum level43 level12 level55)
(sum level43 level14 level57)
(sum level43 level15 level58)
(sum level43 level18 level61)
(sum level43 level21 level64)
(sum level43 level25 level68)
(sum level44 level2 level46)
(sum level44 level4 level48)
(sum level44 level5 level49)
(sum level44 level6 level50)
(sum level44 level9 level53)
(sum level44 level12 level56)
(sum level44 level14 level58)
(sum level44 level15 level59)
(sum level44 level18 level62)
(sum level44 level21 level65)
(sum level44 level25 level69)
(sum level45 level2 level47)
(sum level45 level4 level49)
(sum level45 level5 level50)
(sum level45 level6 level51)
(sum level45 level9 level54)
(sum level45 level12 level57)
(sum level45 level14 level59)
(sum level45 level15 level60)
(sum level45 level18 level63)
(sum level45 level21 level66)
(sum level45 level25 level70)
(sum level46 level2 level48)
(sum level46 level4 level50)
(sum level46 level5 level51)
(sum level46 level6 level52)
(sum level46 level9 level55)
(sum level46 level12 level58)
(sum level46 level14 level60)
(sum level46 level15 level61)
(sum level46 level18 level64)
(sum level46 level21 level67)
(sum level46 level25 level71)
(sum level47 level2 level49)
(sum level47 level4 level51)
(sum level47 level5 level52)
(sum level47 level6 level53)
(sum level47 level9 level56)
(sum level47 level12 level59)
(sum level47 level14 level61)
(sum level47 level15 level62)
(sum level47 level18 level65)
(sum level47 level21 level68)
(sum level47 level25 level72)
(sum level48 level2 level50)
(sum level48 level4 level52)
(sum level48 level5 level53)
(sum level48 level6 level54)
(sum level48 level9 level57)
(sum level48 level12 level60)
(sum level48 level14 level62)
(sum level48 level15 level63)
(sum level48 level18 level66)
(sum level48 level21 level69)
(sum level48 level25 level73)
(sum level49 level2 level51)
(sum level49 level4 level53)
(sum level49 level5 level54)
(sum level49 level6 level55)
(sum level49 level9 level58)
(sum level49 level12 level61)
(sum level49 level14 level63)
(sum level49 level15 level64)
(sum level49 level18 level67)
(sum level49 level21 level70)
(sum level50 level2 level52)
(sum level50 level4 level54)
(sum level50 level5 level55)
(sum level50 level6 level56)
(sum level50 level9 level59)
(sum level50 level12 level62)
(sum level50 level14 level64)
(sum level50 level15 level65)
(sum level50 level18 level68)
(sum level50 level21 level71)
(sum level51 level2 level53)
(sum level51 level4 level55)
(sum level51 level5 level56)
(sum level51 level6 level57)
(sum level51 level9 level60)
(sum level51 level12 level63)
(sum level51 level14 level65)
(sum level51 level15 level66)
(sum level51 level18 level69)
(sum level51 level21 level72)
(sum level52 level2 level54)
(sum level52 level4 level56)
(sum level52 level5 level57)
(sum level52 level6 level58)
(sum level52 level9 level61)
(sum level52 level12 level64)
(sum level52 level14 level66)
(sum level52 level15 level67)
(sum level52 level18 level70)
(sum level52 level21 level73)
(sum level53 level2 level55)
(sum level53 level4 level57)
(sum level53 level5 level58)
(sum level53 level6 level59)
(sum level53 level9 level62)
(sum level53 level12 level65)
(sum level53 level14 level67)
(sum level53 level15 level68)
(sum level53 level18 level71)
(sum level54 level2 level56)
(sum level54 level4 level58)
(sum level54 level5 level59)
(sum level54 level6 level60)
(sum level54 level9 level63)
(sum level54 level12 level66)
(sum level54 level14 level68)
(sum level54 level15 level69)
(sum level54 level18 level72)
(sum level55 level2 level57)
(sum level55 level4 level59)
(sum level55 level5 level60)
(sum level55 level6 level61)
(sum level55 level9 level64)
(sum level55 level12 level67)
(sum level55 level14 level69)
(sum level55 level15 level70)
(sum level55 level18 level73)
(sum level56 level2 level58)
(sum level56 level4 level60)
(sum level56 level5 level61)
(sum level56 level6 level62)
(sum level56 level9 level65)
(sum level56 level12 level68)
(sum level56 level14 level70)
(sum level56 level15 level71)
(sum level57 level2 level59)
(sum level57 level4 level61)
(sum level57 level5 level62)
(sum level57 level6 level63)
(sum level57 level9 level66)
(sum level57 level12 level69)
(sum level57 level14 level71)
(sum level57 level15 level72)
(sum level58 level2 level60)
(sum level58 level4 level62)
(sum level58 level5 level63)
(sum level58 level6 level64)
(sum level58 level9 level67)
(sum level58 level12 level70)
(sum level58 level14 level72)
(sum level58 level15 level73)
(sum level59 level2 level61)
(sum level59 level4 level63)
(sum level59 level5 level64)
(sum level59 level6 level65)
(sum level59 level9 level68)
(sum level59 level12 level71)
(sum level59 level14 level73)
(sum level60 level2 level62)
(sum level60 level4 level64)
(sum level60 level5 level65)
(sum level60 level6 level66)
(sum level60 level9 level69)
(sum level60 level12 level72)
(sum level61 level2 level63)
(sum level61 level4 level65)
(sum level61 level5 level66)
(sum level61 level6 level67)
(sum level61 level9 level70)
(sum level61 level12 level73)
(sum level62 level2 level64)
(sum level62 level4 level66)
(sum level62 level5 level67)
(sum level62 level6 level68)
(sum level62 level9 level71)
(sum level63 level2 level65)
(sum level63 level4 level67)
(sum level63 level5 level68)
(sum level63 level6 level69)
(sum level63 level9 level72)
(sum level64 level2 level66)
(sum level64 level4 level68)
(sum level64 level5 level69)
(sum level64 level6 level70)
(sum level64 level9 level73)
(sum level65 level2 level67)
(sum level65 level4 level69)
(sum level65 level5 level70)
(sum level65 level6 level71)
(sum level66 level2 level68)
(sum level66 level4 level70)
(sum level66 level5 level71)
(sum level66 level6 level72)
(sum level67 level2 level69)
(sum level67 level4 level71)
(sum level67 level5 level72)
(sum level67 level6 level73)
(sum level68 level2 level70)
(sum level68 level4 level72)
(sum level68 level5 level73)
(sum level69 level2 level71)
(sum level69 level4 level73)
(sum level70 level2 level72)
(sum level71 level2 level73)

(connected l0 l3)
(fuelcost level21 l0 l3)
(connected l0 l4)
(fuelcost level2 l0 l4)
(connected l0 l6)
(fuelcost level25 l0 l6)
(connected l0 l7)
(fuelcost level15 l0 l7)
(connected l0 l8)
(fuelcost level5 l0 l8)
(connected l1 l8)
(fuelcost level6 l1 l8)
(connected l2 l6)
(fuelcost level4 l2 l6)
(connected l3 l0)
(fuelcost level21 l3 l0)
(connected l3 l4)
(fuelcost level2 l3 l4)
(connected l3 l6)
(fuelcost level25 l3 l6)
(connected l4 l0)
(fuelcost level2 l4 l0)
(connected l4 l3)
(fuelcost level2 l4 l3)
(connected l4 l6)
(fuelcost level14 l4 l6)
(connected l5 l7)
(fuelcost level9 l5 l7)
(connected l5 l8)
(fuelcost level12 l5 l8)
(connected l6 l0)
(fuelcost level25 l6 l0)
(connected l6 l2)
(fuelcost level4 l6 l2)
(connected l6 l3)
(fuelcost level25 l6 l3)
(connected l6 l4)
(fuelcost level14 l6 l4)
(connected l6 l7)
(fuelcost level18 l6 l7)
(connected l7 l0)
(fuelcost level15 l7 l0)
(connected l7 l5)
(fuelcost level9 l7 l5)
(connected l7 l6)
(fuelcost level18 l7 l6)
(connected l8 l0)
(fuelcost level5 l8 l0)
(connected l8 l1)
(fuelcost level6 l8 l1)
(connected l8 l5)
(fuelcost level12 l8 l5)

(at t0 l7)
(fuel t0 level73)
(= (total-cost) 0)

(at p0 l8)
(at p1 l3)
(at p2 l5)
(at p3 l3)
)

(:goal
(and
(at p0 l7)
(at p1 l0)
(at p2 l0)
(at p3 l0)
)
)
(:metric minimize (total-cost)))

; plan
1. (drive t0 l7 l5 level64 level9 level73)
   deleted: (at t0 l7) (fuel t0 level73)
   added: (at t0 l5) (fuel t0 level64)
   goals met: 0 of 4
2. (load p2 t0 l5)
   deleted: (at p2 l5)
   added: (in p2 t0)
   goals met: 0 of 4
3. (drive t0 l5 l8 level52 level12 level64)
   deleted: (at t0 l5) (fuel t0 level64)
   added: (at t0 l8) (fuel t0 level52)
   goals met: 0 of 4
4. (load p0 t0 l8)
   deleted: (at p0 l8)
   added: (in p0 t0)
   goals met: 0 of 4
5. (drive t0 l8 l0 level47 level5 level52)
   deleted: (at t0 l8) (fuel t0 level52)
   added: (at t0 l0) (fuel t0 level47)
   goals met: 0 of 4
6. (drive t0 l0 l3 level26 level21 level47)
   deleted: (at t0 l0) (fuel t0 level47)
   added: (at t0 l3) (fuel t0 level26)
   goals met: 0 of 4
7. (load p3 t0 l3)
   deleted: (at p3 l3)
   added: (in p3 t0)
   goals met: 0 of 4
8. (load p1 t0 l3)
   deleted: (at p1 l3)
   added: (in p1 t0)
   goals met: 0 of 4
9. (drive t0 l3 l4 level24 level2 level26)
   deleted: (at t0 l3) (fuel t0 level26)
   added: (at t0 l4) (fuel t0 level24)
   goals met: 0 of 4
10. (drive t0 l4 l0 level22 level2 level24)
   deleted: (at t0 l4) (fuel t0 level24)
   added: (at t0 l0) (fuel t0 level22)
   goals met: 0 of 4
11. (unload p1 t0 l0)
   deleted: (in p1 t0)
   added: (at p1 l0)
   goals met: 1 of 4
12. (unload p2 t0 l0)
   deleted: (in p2 t0)
   added: (at p2 l0)
   goals met: 2 of 4
13. (unload p3 t0 l0)
   deleted: (in p3 t0)
   added: (at p3 l0)
   goals met: 3 of 4
14. (drive t0 l0 l7 level7 level15 level22)
   deleted: (at t0 l0) (fuel t0 level22)
   added: (at t0 l7) (fuel t0 level7)
   goals met: 3 of 4
15. (unload p0 t0 l7)
   deleted: (in p0 t0)
   added: (at p0 l7)
   goals met: 4 of 4
